announcements/notifications-and-tts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-10 Tue 17:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Multiple TTS Streams On The Emacspeak Audio Desktop</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">Using Multiple TTS Streams On The Emacspeak Audio Desktop</h1>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacspeak now uses multiple text-to-speech streams &#x2014; as an example,
this enables spoken notifications that do not interrupt ongoing spoken
output. To make such notifications more perceivable, Emacspeak places
notifications to the right of the user by leveraging Linux-ALSA
features that allow one to scale the amplitude of the left and right
audio channels.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Background</h2>
<div class="outline-text-2" id="text-2">
<p>
Until now, Emacspeak has used a single instance of a Text-To-Speech
(TTS) engine to produce all spoken feedback. An unfortunate
consequence is that any spoken announcement necessarily interrupts
ongoing speech; as an example, an incoming instant-message (e.g.,
Jabber notification) can interrupt what you're currently
reading. 
</p>

<p>
Emacs itself produces a large number of asynchronous messages
depending on the number of processes running within Emacs; at present,
all Emacs generated messages are <i>equal</i> though there are ongoing
plans to improve this situation going forward, e.g., using package
<code>alert</code>. With Emacspeak now able to use multiple TTS streams, arrival
of package <code>alert</code> within Emacs should facilitate smarter handling of
different categories of messages over time.
</p>

<p>
Playing multiple TTS streams simultaneously can make it hard to
understand the resulting output; Emacspeak leverages underlying ALSA
functionality to send notifications to a virtual ALSA device that
places the auditory output <i>mostly</i> on the right channel. See the
following paragraphs on setup/configuration. I'm presently using this
on Linux with the <code>linux-outloud</code> voice &#x2014; you need to have a copy of
this TTS engine installed and working &#x2014; see <a href="http://voxin.oralux.net/">Voxin</a> for details on
obtaining that engine. Note: the Emacspeak <code>espeak</code> server does not
use raw ALSA for its output &#x2014; consequently, notifications produced
by  <code>espeak</code> play on both left and right channels, making it
impossible to understand. The <code>mac</code> server may be able to support
this functionality using something Mac-specific &#x2014; patches welcome.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Emacspeak Setup</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Emacspeak now adds user-option
<code>emacspeak-tts-use-notify-stream</code>. If this is set to <code>t</code> in the
user's initialization file <b>before Emacspeak is loaded</b>, Emacspeak
checks to see if the user's selected TTS engine supports multiple
instances, and if so launches a second instance of the TTS engine
for use as a <i>Notification TTS Stream</i>. See my
<code>tvr/emacs-startup.el</code> in the Emacspeak Git Repository for  an
example setup.</li>
<li>The <i>Notification TTS Stream</i> can be restarted via command
<code>dtk-notify-initialize</code> bound to <code>C-e d C-n</code>. You should
ordinarily not need   to invoke this command.</li>
<li>The <i>Notification TTS Stream</i> can be shut-down using command
<code>dtk-notify-shutdown</code> bound to <code>C-e d C-s</code>. When  the  /Notification
TTS Stream is not available, Emacspeak defaults to using a single
TTS stream for all spoken output &#x2014; i.e., no change.</li>
<li>At present, emacspeak tries to use a separate  <i>Notification TTS
Stream</i>  when the selected TTS engine is a software TTS 
running locally.</li>
<li>File <code>servers/linux-outloud/notify-asoundrc</code> contains the
<code>.asoundrc</code> that I am using on my thinkpad. To have Emacspeak
place the <i>Notification TTS Stream</i> mostly on the right,  the
contents of that file (suitably modified for your sound card)
need  to be placed in file <code>$HOME/.asoundrc</code>. Warning: Handle with
care &#x2014; a broken <code>.asoundrc</code> can kill all audio output.</li>
<li>The <code>.asoundrc</code> scales  left and right amplitude  to place the
output <i>mostly on the right</i> &#x2014; to change this behavior, you can
edit the <i>Transformation Table</i> for virtual device <code>tts_mono</code> in
the <code>.asoundrc</code> file.</li>
<li>This set-up has not been tested with <code>pulseaudio</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
Share and enjoy &#x2014;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-10 Tue&gt;</span></span></p>
<p class="author">Author: raman</p>
<p class="date">Created: 2015-11-10 Tue 17:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
